app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-01-16 20:29:11.716646"], ["updated_at", "2019-01-16 20:29:11.716646"]]
---
  def create
    school_class = SchoolClass.create(school_class_params)

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-01-16 20:21:38.920911"], ["id", 1]]
---
  def update
    find_school_class
    @school_class.update(school_class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", nil]]
---
  def find_school_class
    @school_class = SchoolClass.find(params[:id])