app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-01-16 20:27:52.412464"], ["updated_at", "2019-01-16 20:27:52.412464"]]
---
  def create
    student = Student.create(student_params)

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-01-16 20:11:13.047488"], ["id", 1]]
---
  def update
    find_student
    @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", nil]]
---
  def find_student
    @student = Student.find(params[:id])